[
    {
        "joke": "(Stands center stage, adjusts mic)\n\nSo, anyone else feel like their job description is just “everything” these days? Like, you signed up to manage social media, and now you’re also in charge of ordering office snacks *and* mediating disputes over the thermostat? And you think *you’re* stressed? Imagine being Superman.\n\n(Pauses for laughter)\n\nSeriously. He’s got a full cart of organic kale at the grocery store. Gotta maintain the physique, you know? It’s a whole thing. But it’s not just the kale. It’s the paperwork. His performance review is…something. “Strengths: Intergalactic threat neutralization.” Solid. “Weaknesses: Doesn’t fill out expense reports.” Apparently, saving the world doesn’t automatically excuse you from submitting receipts. \n\n(Beat)\n\n“Needs improvement in team building. Apparently, casually lifting a collapsing building is ‘intimidating’ to the construction crew.” Like, what does he do? Offer a sensitivity workshop? “Consistently exceeds expectations…which is terrifying for HR.” And the company picnic? Disaster. He accidentally won every single game. Every. Single. One.\n\n(Slightly exasperated tone)\n\nBut it's not just the paperwork. It's the *restraint*. **“The emotional toll of constantly having to *hold back* – like being a super-powered mime.”** I mean, someone drops their phone, right? Normal person bends down, picks it up. Superman? Internal monologue: “Just a gentle fingertip…a micro-burst of air…no one would even notice!” (Clenches fists, strains a smile) He’s basically a walking, talking, flying pressure cooker.\n\n(Beat, shifts to a more conversational tone)\n\nAnd then there's his personal life. Dating a journalist when you have a secret identity? Nightmare fuel. Lois is…a lot. She’ll be like, “Clark, you saved a cat from a tree *again*? That's not a crisis, that's a Tuesday!” And he’s all, “But…it was a very fluffy cat!” (Delivers with genuine sincerity). Honestly, **“Kryptonite isn’t just a weakness, it’s a lifestyle.”** Lois is starting to refer to Lex Luthor as her “research consultant.” I’m not even kidding.\n\n(Paces slightly)\n\nBut what happens when Superman wants to retire? He's basically immortal, right? So they've been trying to find a replacement for decades. They tried a guy with super-strength, but no sense of direction. He kept accidentally punching holes in Canada. Then there was the one who could fly, but was terrified of heights. Seriously. \n\n(Beat)\n\nCurrently, they're testing a guy who can…slightly increase the temperature of lukewarm coffee. It's not going well.\n\n(Looks off into the distance, adopts a melancholic tone)\n\nHe just sits on a rooftop, staring into the distance, muttering, “Am I…replaceable?” Lois walks up, completely unfazed. “Clark, you just saved a school bus full of children from a rogue meteor. You're doing fine.”\n\n(Shrugs)\n\nHe sighs. “But what if the next meteor is…lukewarm?”\n\n\n\n(Beat, looks directly at the audience)\n\nHonestly, I think he needs a vacation. And maybe a good therapist. And definitely a better benefits package.\n\n\n\n",
        "score": {
            "brevity": 7,
            "coherence": 9,
            "originality": 8,
            "punchline": 8,
            "appeal": 8,
            "explanation": "This is a strong bit built around a clever premise: applying mundane office/life frustrations to Superman. The coherence is excellent – the escalating absurdity of Superman's 'workplace' issues is well-maintained. Originality is high; while the 'Superman with everyday problems' concept isn't *entirely* new, the execution is fresh and detailed. The punchlines (especially the 'super-powered mime' and 'Kryptonite is a lifestyle' lines) are well-crafted and land effectively. Audience appeal is broad; most people can relate to job stress and the frustrations of daily life, even when projected onto a superhero. The bit is a little lengthy, which slightly impacts brevity, but the consistent quality keeps it engaging.",
            "total": 40
        }
    },
    {
        "joke": "(Stands center stage, adjusts mic, looks slightly weary)\n\nAnyone else ever feel like they're wildly overqualified for their job? I do. And I say that as a guy who… well, let's just say my job description is a little broad. It's mostly 'Prevent Global Catastrophes.' Benefits are surprisingly mediocre. Seriously, the dental is *terrible*.\n\nMy last performance review? It was… awkward. My boss, this guy named Bob, just kept saying, 'Look, the planet's still here. Good job.' Like, that's it? No constructive criticism? He did dock me points for 'excessive use of company property' because I used heat vision to make s'mores at the office picnic.\n\nBut the *real* killer? The constant holding back. It's exhausting. Imagine having the power to solve world hunger, but you're told, 'No, no, gotta let them figure it out. Free will and all that.' It's like being a super-powered mime. All this potential, and I'm just… silently judging everyone's life choices. (Does a tiny, frustrated mime gesture, holds it a beat longer) I've started taking improv classes. It's the only place I can *legally* express myself without accidentally leveling a city.\n\nAnd then there's the Kryptonite thing. Everyone thinks it's a weakness, right? It's not. It's… a boundary issue. Seriously. Lex Luthor doesn't *want* to hurt me. He wants to be the one who gets to hold the green rock. It's a power dynamic. He's like, 'Oh, you're feeling strong today, Superman? Let me just… *adjust* that.' (Mimics Luthor adjusting a dial) My therapist says I attract emotionally unavailable villains.\n\nAnd don't even get me started on the succession plan. I'm basically immortal. They've been trying to find a replacement for decades. They started a 'Superman Academy.' It was… ambitious. They figured, “**Superman is functionally immortal (solar energy, etc.). What happens when he *eventually* decides to retire (or just needs a vacation)?**” – how hard could it be? Turns out, *very* hard.\n\nOne kid, bless his heart, developed the ability to control pigeons. Just… pigeons. He spent three days trying to stop a bank robbery with a flock of birds. It was… messy. Then there was the one who could only fly sideways. *Sideways!* He kept crashing into buildings. We had to issue him a helmet. And a very large apology to the city of Metropolis. Honestly, at this point, I'm thinking of just training a really smart dog.\n\nSo yeah, saving the world. It's on my resume. But sometimes, I look at all these problems, and I think… maybe humanity *deserves* a little bit of catastrophe. Just to spice things up. Don't tell Bob in HR. (Slightly unsettling smile, pauses for laughter)\n\n\n\n",
        "score": {
            "brevity": 7,
            "coherence": 9,
            "originality": 9,
            "punchline": 8,
            "appeal": 7,
            "explanation": "This is a very strong bit! It's not *super* concise (hence the 7 for brevity), as it builds through several layers of absurdity. However, the coherence is excellent – the 'overqualified Superman' premise is maintained beautifully throughout, and each anecdote flows logically. The originality is high; the mundane complaints of a superhero (bad dental, awkward reviews, emotional unavailability of villains) are a fresh and hilarious take. Punchlines are consistently good, landing with a mix of relatable frustration and superhero-specific absurdity (pigeon-controlling student, sideways flyer). Audience appeal is slightly lower because it relies on familiarity with Superman tropes, but the core themes of workplace frustration and feeling underappreciated are universal enough to connect with a broad audience. The improv class and therapist bits are particularly strong additions.",
            "total": 40
        }
    },
    {
        "joke": "(Stands center stage, adjusts mic)\n\nAnyone ever feel like they're wildly overqualified for their job? Like, you’re showing up, doing the bare minimum, and thinking, “I could be curing diseases, composing symphonies, *something*… but here I am, alphabetizing staplers.” And I say that as a guy who… well, let's just say my job description is a little broad. It's mostly 'Prevent Global Catastrophes.' Benefits are okay, dental's surprisingly good.\n\nSeriously, my performance reviews are a *nightmare*. Last one said, “Superman, while consistently exceeding expectations in planetary defense, needs to demonstrate more initiative in team-building exercises.” Like, I'm coordinating evacuations during an alien invasion! What team-building exercise am I missing? They suggested trust falls. With Lex Luthor. I politely declined. \n\nBut the hardest part isn't the disasters, it's the *restraint*. You wouldn't believe. I was at a coffee shop, someone was being *incredibly* rude to the barista… and I just wanted to gently float their latte back onto the counter. Had to clench my fists. It's exhausting. I'm basically a super-powered mime. And let me tell you, mime is *not* a good outlet for repressed rage.\n\nAnd then there's the whole 'finding a replacement' thing. Apparently, they're holding auditions. The casting director was like, “Okay, can you look inspiring while simultaneously being emotionally vulnerable and also slightly susceptible to green rocks?” It's… a very specific skillset. I told him, “Look, I’m not saying I have a codependency issue with Lex Luthor, but I *do* get anxious when he's not actively trying to kill me.” \n\nThey had one guy who could fly, but he kept complaining about the wind chill. Another could lift buildings, but only if he had a protein shake beforehand. It was a disaster. Honestly, after watching the auditions, I've decided I'm just gonna keep doing this. It's easier than dealing with HR. \n\n(Pause for laughter)\n\nPlus, the dental plan really *is* good.\n\n\n\n",
        "score": {
            "brevity": 7,
            "coherence": 9,
            "originality": 8,
            "punchline": 8,
            "appeal": 7,
            "explanation": "This is a strong bit built around a clever premise – a superhero dealing with mundane workplace frustrations. The coherence is excellent; the escalating absurdity flows logically. The originality comes from flipping the superhero trope on its head, focusing on the bureaucratic annoyances rather than epic battles. Punchlines are consistently good, landing with the 'trust falls with Lex Luthor' and 'green rocks' lines being particularly strong. Appeal is slightly lower because the premise relies on some familiarity with superhero tropes, but the relatable frustration with work makes it accessible. It's a bit long for a single joke, leaning more towards a short routine, but each section builds effectively.",
            "total": 39
        }
    },
    {
        "joke": "(Stands center stage, adjusts mic)\n\nAnyone else ever feel like they're wildly overqualified for their job? Like, you’re doing the work of three people, and your boss is still asking you to refill the stapler? Yeah? Good. That got me thinking about Superman…\n\n(Pause for recognition, slight exasperated tone)\n\nBecause *he’s* the ultimate overqualified employee. Seriously, his job description is just…everything. “Prevent global catastrophes. Maintain atmospheric stability. Occasionally rescue cats from trees.” It's exhausting just *reading* it. And I bet his boss is *still* asking him to do more. “Hey, Superman, can you swing by accounting and fix the printer?” Like, come on!\n\nBut the biggest thing that gets me…the disguise. The glasses! Seriously? *Glasses*? He's flying around saving planets, but he thinks a pair of glasses is enough to fool everyone? It's like dressing up as a ninja with a brightly colored headband. I tried the glasses thing once. Didn't work. Just made me look like I needed glasses.\n\n(Paces slightly)\n\nThink about it. Every single second, somewhere on Earth, something is going wrong. And he has to be aware of it *all*. It's sensory overload! He's trying to enjoy a quiet dinner with Lois, and his phone just keeps buzzing. “Asteroid inbound. Volcano erupting. Someone's cat is stuck in a tree…again.” I get stressed when I have three unread emails.\n\n(Slightly quieter, more reflective)\n\nAnd the self-control! Imagine seeing someone struggling to open a jar of pickles, and you have to just…stand there. Clench your fists. Resist the urge to gently unscrew the lid with your heat vision. It's like being a superhero in a library. Constant internal screaming. \n\n(Beat, looks directly at the audience)\n\nYou know what I think the real problem is? He's developed crippling anxiety. He's constantly anticipating the next disaster. He's probably got a whole spreadsheet of potential apocalypses. He’s not saving the world. He’s *managing* the world. And honestly? That sounds way more stressful than my job.\n\n\n\n(Holds for laughter, shrugs)\n\n\n\n",
        "score": {
            "brevity": 7,
            "coherence": 9,
            "originality": 8,
            "punchline": 7,
            "appeal": 8,
            "explanation": "This is a strong bit built around a relatable premise (feeling overqualified) and a clever application to Superman. The coherence is excellent – the Superman analogy is consistently maintained and explored. The originality comes from framing Superman not as a hero, but as an incredibly stressed, over-managed employee. While there aren't huge, explosive punchlines, the humor is consistently delivered through insightful observations and relatable anxieties. The 'glasses' bit is a solid, recognizable comedic trope. The appeal is broad – most people can relate to feeling overwhelmed or underappreciated at work, and Superman is a universally known figure. It's a bit long for a quick one-liner set, but perfect for a 5-10 minute slot. The pacing is good, building to the final comparison of Superman's 'management' role to the speaker's job.",
            "total": 39
        }
    },
    {
        "joke": "(Stands center stage, adjusts mic)\n\nAnyone else ever feel like they’re wildly overqualified for their job? Like, you’re doing data entry when you have a Master’s in astrophysics? It’s… humbling. You know who *really* has that problem? Superman. Like, yeah, saved the world again. Tuesday. \n\nIt’s not the glory that gets to him, it’s the paperwork. Honestly, **“He’s the ultimate overqualified employee; saving the world is probably listed as ‘other duties as assigned’ on his performance review.”** His last review said, “Excellent work on the asteroid deflection. Needs to delegate more cat rescues.” I mean, come on. Honestly, I bet his biggest fear isn't Lex Luthor, it's getting a strongly worded email from HR. “Subject: Regarding Excessive Heat Vision Usage – Please See Attached Policy.”\n\nAnd it's not the villains that get to him, it's the *restraint*. **“The emotional toll of constantly having to *hold back* – like being a super-powered mime.”** Imagine trying to assemble IKEA furniture. You can't just *will* it together. You have to use the Allen wrench. It's torture. He's basically a walking, flying, incredibly strong exercise in frustration. He's one wrongly placed screw away from leveling a city.\n\nAnd then there's Kryptonite. Everyone thinks it's a weakness… but it’s not like he gets weak, he just gets…*irritated*. **“Kryptonite isn’t just a weakness, it’s a symbol of external forces controlling Superman.”** It’s like someone’s constantly mansplaining the plot of his own life. “No, *I* saved the President, Brenda! You weren’t there!” It's not a weakness, it's a really intense headache.\n\nHonestly, I think he's just…tired. He’s been doing this for decades. **“The Problem of Succession Planning”** is a nightmare. They held auditions. Turns out, “can wear tights” isn’t a qualification. They needed someone who could inspire hope, stop global threats, *and* handle the press. It was a disaster. \n\nHe’s thinking of just ghosting. Changing his name, moving to Nebraska, opening a bakery. No capes. Just croissants. Honestly, that’s the real hero move. Trading world-saving for sourdough. Now *that’s* a retirement plan.\n\n\n\n(Beat, smiles)\n\n\n\nThank you, thank you. You’ve been a great audience. Try the veal!\n\n\n\n",
        "score": {
            "brevity": 7,
            "coherence": 9,
            "originality": 8,
            "punchline": 8,
            "appeal": 7,
            "explanation": "This is a strong bit built around a clever premise – Superman as an office worker. The coherence is excellent; the entire routine consistently reinforces the 'overqualified employee' angle. Originality is high; while the 'Superman with mundane problems' idea isn't *completely* new, the execution is fresh and detailed. The punchlines (highlighted in bold) are well-crafted and land effectively, using relatable office humor to subvert the superhero trope. Brevity is good, though some sections could be tightened. Audience appeal is solid, relying on a universally known character and relatable frustrations, but might be slightly lower for those unfamiliar with office culture or superhero tropes. The bit relies heavily on extended metaphors and callbacks, which is effective but requires attentive listening.",
            "total": 39
        }
    },
    {
        "joke": "(Stands center stage, adjusts tie – even though wearing a Superman suit under the jacket. A slightly weary expression.)\n\nUgh. Another bake sale. Seriously? Do you know how hard it is to subtly use heat vision to perfectly brown 300 cookies? It's exhausting. People think it's all saving the world. It's mostly… logistics. \n\nAnd the paperwork! My performance review? It's brutal. \"Superman, while your global crisis intervention rate is exemplary, your filing of Form 27-B regarding dimensional rifts is consistently late.\" Like, I stopped a black hole from swallowing Cleveland, Brenda! Cut me some slack! And the expense reports! \"Please itemize the cost of atmospheric re-entry. Also, the dry cleaning bill for the cape is… substantial.\" It's silk, okay? It needs special care! My bonus is a key to Metropolis. Which is… nice, I guess? Can't buy groceries with it.\n\nIt's not just the paperwork, though. It's the *restraint*. Yesterday, a guy cut me off in traffic. I *could* have gently rotated his car 180 degrees. But I didn't. I just… sighed. The internal struggle is real. I'm pretty sure I'm developing a twitch.\n\nAnd then there's the Kryptonite. Don't even get me started. Lex Luthor sends me Kryptonite for my birthday *every* year. It's passive-aggressive. Like, \"Here, feel bad about yourself. Also, I built a robot.\" I'm starting to think he just wants to see a doctor's bill.\n\nHonestly, the question everyone avoids is: What happens when I retire? The interview process is insane. We had a guy who could *almost* leap a building. He tripped on the landing. Then there was a woman who insisted her superpower was “extreme empathy.” Turns out she just cried a lot. And everyone has to pass the Spandex Tolerance Test. It's… humiliating. Honestly, at this point, I'm considering just cloning myself. But then I'd have to deal with family drama. \n\nYou know, sometimes I just want to order pizza and binge-watch reality TV. But then I remember I have to save a kitten from a tree. *Again*. It's a glamorous life, really. Mostly just… exhausting. As they say, **“He’s the ultimate overqualified employee; saving the world is probably listed as “other duties as assigned” on his performance review.”** And frankly, I'm starting to think I need a new career. Maybe accounting. Less spandex.\n\n\n\n(Beat. Looks directly at the audience.)\n\nAnyone know a good headhunter?\n\n\n\n",
        "score": {
            "brevity": 7,
            "coherence": 9,
            "originality": 8,
            "punchline": 7,
            "appeal": 8,
            "explanation": "This is a strong bit of character-driven humor. It's not a single joke, but a series of interconnected observations, which is fine for a longer set. The premise – Superman dealing with mundane office life – is clever and well-executed. The coherence is excellent; each anecdote builds on the central idea. Originality is high; while superhero deconstruction exists, the focus on bureaucratic frustrations and the relatable exhaustion is fresh. The 'punchline' (the final line about a headhunter) isn't a huge laugh riot on its own, but it's a solid capstone to the bit, reinforcing the central theme of wanting out. The appeal is broad; most people can relate to workplace frustrations, even if they don't have superpowers. The bit relies on sustained character work and a consistent tone, making it more of a mini-routine than a quick one-liner, which impacts the 'brevity' score. The final line is a good tag, but not a massive payoff.",
            "total": 39
        }
    },
    {
        "joke": "(Stands center stage, adjusts mic)\n\nAnyone else ever feel like their job description is just…vague? Like, “Manage projects, contribute to team success, prevent global annihilation.” It’s right there on the bottom of most resumes. That’s Superman’s *Monday*. He’s the ultimate overqualified employee. \n\nAnd his performance reviews? Brutal. “Superman consistently exceeds expectations in crisis management, but needs to improve his delegation skills. Continues to ‘single-handedly’ resolve issues. Teamwork is a priority.” Like, what’s he supposed to do, *ask* the Flash for help? And the ‘Areas for Improvement’ section is just a picture of a city skyline with a lot of rubble.\n\nBut the real problem isn't the workload, it's the *restraint*. Imagine having that much power and having to…not use it. **“The emotional toll of constantly having to *hold back* – like being a super-powered mime.”** Someone cuts you off in traffic? You could gently lift their car and place it in a nearby lake. But you don't! You just…honk. And internally scream. He’s basically a walking, flying pressure cooker of suppressed rage.\n\nAnd then there's Kryptonite. Everyone thinks it's a weakness, but I'm telling you, it's a *relationship* issue. **“Kryptonite isn’t just a weakness, it’s a symbol of external forces controlling Superman. It’s a physical manifestation of his inability to fully be himself, or to escape the expectations placed upon him.”** Lois is *convinced* Lex Luthor is his 'fixer-upper.' She's like, \"He just needs someone to love him, and I'm the only one who can provide that!\" I'm like, \"Lois, he's trying to *destroy the planet*!\" I had to explain to Superman that 'rescuing' someone who repeatedly tries to kill you isn't love, it's…a really bad habit.\n\nAnd what happens when Superman finally wants a vacation? Or, you know, a mid-life crisis? **“The Problem of Succession Planning: Superman is functionally immortal (solar energy, etc.). What happens when he *eventually* decides to retire (or just needs a vacation)? Is there a Superman Academy? Is there a rigorous vetting process?”** They tried a reality show. “Next Top Superman.” It was a disaster. Everyone just kept trying to fly through buildings for ratings. \n\nTurns out, being Superman isn't about superpowers, it's about having really good dental. All that smiling for the cameras, the public appearances… gotta keep those pearly whites shining while saving the world. It's a lot of pressure. Honestly, I feel bad for the guy. He’s got the weight of the world on his shoulders… and a really strict dental plan.\n\n\n\n(Beat, smiles)\n\nThank you, thank you. You’ve been a super audience!\n\n\n\n",
        "score": {
            "brevity": 7,
            "coherence": 9,
            "originality": 8,
            "punchline": 7,
            "appeal": 8,
            "explanation": "This is a strong bit built on a clever premise: applying mundane office/relationship tropes to Superman. The coherence is excellent – the entire routine consistently maintains the 'Superman as an employee' framing. Originality is high; while superhero-as-everyman isn't *new*, the specific angles (performance reviews, succession planning, dental care) are fresh. Punchlines are solid, particularly the 'super-powered mime' and the Lois Lane bit, but some feel a little more like extended observations than sharp, concise payoffs. Audience appeal is broad; most people can relate to job frustrations and relationship dynamics, even when applied to a fantastical character. The length is good for a developing comedian, and the pacing allows for the ideas to land. It's a well-constructed and thoughtfully written piece.",
            "total": 39
        }
    },
    {
        "joke": "(Stands center stage, adjusts mic, looks slightly weary)\n\nSo, you know what really gets me? Online customer service. Spending 45 minutes explaining to someone why my toaster oven isn’t recognizing bagels as a valid bread product. It’s… frustrating. You know what *really* has to be frustrating? Being Superman.\n\n(Pause for chuckle)\n\nSeriously. Imagine the interoffice memos. “Please remember to submit your expense reports for meteor deflection. Mileage is reimbursed at the standard galactic rate.” And the HR department? Forget about it. “Clark, we need you to attend mandatory sensitivity training. Apparently, ‘saving the day’ can be perceived as ‘mansplaining global crises.’” \n\n(Beat)\n\nIt’s like, he’s the ultimate overqualified employee; **“saving the world is probably listed as ‘other duties as assigned’ on his performance review.”** I picture him trying to book a week off, and the system just says, “Error: Global instability detected. Request denied.” Like, does he even *get* vacation time?\n\n(Slightly exasperated)\n\nAnd it's not just the workload. It's the emotional labor. It’s like being at a kid's birthday party and knowing you could stop a rogue bouncy castle from flying into traffic, but you just…stand there. You just politely clap. That's a special kind of torture. I struggle to hold back from commenting on people's questionable life choices, honestly. It’s like being a super-powered mime – **“the emotional toll of constantly having to *hold back* – like being a super-powered mime.”**\n\n(Beat, shifts tone slightly)\n\nBut then there's the whole Kryptonite thing… which, let’s be real, is a relationship issue. Lois Lane is *clearly* the one who keeps accidentally leaving Kryptonite around. It's passive-aggressive, honestly. Like, “Oh, I just found this interesting rock. It really brings out your eyes…and weakens your superpowers.” She’s probably got a whole collection. “This one’s for when you forget to take out the trash. This one’s for when you don’t compliment my reporting.”\n\n(Pause for laughter)\n\nBut the biggest question… who replaces him? They're not looking for someone with superpowers. They're looking for someone with *insurance*. **“Superman is functionally immortal (solar energy, etc.). What happens when he *eventually* decides to retire (or just needs a vacation)? Is there a Superman Academy? Is there a rigorous vetting process?”** No, they’re looking for someone who won’t bankrupt the planet with medical bills.\n\n(Beat, delivers final line with a sigh)\n\nThe job posting is just a list of disclaimers. “Benefits include: Frequent alien encounters, existential dread, and a cape that gets caught in revolving doors.” Honestly? I think he’ll just keep showing up. Someone has to.\n\n\n\n",
        "score": {
            "brevity": 7,
            "coherence": 8,
            "originality": 9,
            "punchline": 8,
            "appeal": 7,
            "explanation": "This is a very strong bit. The core concept – applying mundane office/relationship frustrations to Superman – is highly original and consistently funny. The coherence is excellent; the bit builds logically from the initial premise. While not every line is a massive laugh, the punchlines are well-placed and land effectively, particularly the 'other duties as assigned' and Lois Lane/Kryptonite bits. The length is good, allowing for exploration of the idea without overstaying its welcome. Appeal is slightly lower because the humor relies on familiarity with Superman tropes, but the relatable office/relationship angles broaden its reach. The 'insurance' and job posting lines are particularly strong closers.",
            "total": 39
        }
    },
    {
        "joke": "(Stands center stage, adjusts mic)\n\nAnyone else ever feel like they're wildly overqualified for their job? Like you’re showing up to build a birdhouse with a degree in astrophysics? And that got me thinking about Superman…\n\n(Pause for recognition)\n\nHe’s the ultimate overqualified employee. Seriously. “Strengths: Intergalactic threat neutralization. Areas for Improvement: Needs to delegate more. Keeps taking on all the asteroid deflection himself.” I mean, *I* get a free bagel on my birthday. He’s saving planets!\n\nBut let's be real, the *real* superpower isn't flying. It's… logistics. **“The sheer logistical nightmare of maintaining a secret identity in the 21st century.”** Like, how does Clark Kent explain all the missed work? “Oh, just a really bad case of… space allergies?” And the social media! He has to have *two* separate phone plans. Two Instagram accounts. It's exhausting! Imagine the data usage. I bet he's constantly deleting location data. “No, I wasn't near that exploding volcano, Brenda!”\n\n(Slightly exasperated)\n\nBut it's not just the tech, it's the *emotional* weight of it all. **“The emotional toll of constantly having to *hold back* – like being a super-powered mime.”** Imagine waiting in line at the DMV. Someone cuts you. You have the power to gently *relocate* them to another state… but you can’t. You just… sigh. And fill out form 27B/6. It's gotta be exhausting! Like, \"I could solve world hunger, but Karen is arguing about a coupon.\"\n\n(Shifts tone, more cynical)\n\nAnd Kryptonite? Everyone thinks it's just a weakness, right? No. It's… complicated. Lois is just *done*. She's like, “It's always *something* with you, Clark. First it's the cape, now it's the green rocks?” I bet she hides the Kryptonite in the cookie jar. “Just a little something to keep you grounded.” \n\n(Beat)\n\nHonestly, I think Lois is planning for the inevitable. She’s already scouting potential replacements. I overheard her telling Martha Kent, “He needs someone who can handle the pressure… and doesn't leave their cape in the washing machine.” I think she's grooming Supergirl. It's a whole *thing*.\n\n(Slight pause, shrugs)\n\nHonestly, I think he just wants to be a mild-mannered accountant. No capes, no villains, just… spreadsheets. But then Lois finds out and says, “Absolutely not. You have a brand to maintain.”\n\n\n\n(Beat, looks directly at the audience)\n\nHe’s saving the world, and she’s worried about his *brand*. That’s a marriage, folks. That’s a marriage.\n\n\n\n",
        "score": {
            "brevity": 7,
            "coherence": 8,
            "originality": 9,
            "punchline": 8,
            "appeal": 7,
            "explanation": "This is a very strong bit. It takes a familiar trope (overqualification) and applies it to a wildly unexpected character (Superman), creating immediate originality. The coherence is excellent; the bit builds logically from the initial premise, exploring the absurdities of Superman's life in a modern context. The punchlines aren't explosive, single-line zings, but rather clever observations that land consistently throughout (the logistics, the mime analogy, Lois hiding Kryptonite). The 'brand' punchline at the end is a solid closer. Brevity is slightly lower because it's a longer bit with multiple layers, but it's well-paced. Audience appeal is good, relying on relatable frustrations (work, relationships) framed through a pop culture lens, but might require some pre-existing Superman knowledge for full appreciation.",
            "total": 39
        }
    },
    {
        "joke": "(Stands center stage, looking slightly rumpled, adjusting tie)\n\nSo, anyone ever feel like they’re being micromanaged? Like, my boss emails me at 11:58 PM asking if I used Oxford commas in a draft. Oxford commas! Like the world hinges on my punctuation choices. You think *that’s* controlling? Try being Superman.\n\n(Pauses for laughter)\n\nMy performance review is… interesting. ‘Strengths: Preventing planetary annihilation. Areas for Improvement: Teamwork. Apparently, vaporizing threats unilaterally isn’t ‘collaborative.’ It’s always the little things, you know? Lois asks me to change a lightbulb. ‘It’s a *small* world, Clark!’ No, Lois, it’s a world I could orbit in 90 seconds, but sure, I’ll get the ladder. \n\n(Briefly attempts to delicately change a lightbulb with heat vision, nearly destroying the fixture. Exaggerated flinch from the audience.)\n\nBut it’s not just the lightbulbs. It’s the *holding back*. Imagine knowing you could solve world hunger with a single thought, but you can’t, because… collateral damage. It’s exhausting. As one observation put it, **“The emotional toll of constantly having to hold back – like being a super-powered mime.”** I’m a super-powered mime. A bank robbery? I can’t just *stop* the bullets. I have to… *slowly*… redirect them into the ceiling. It’s performance art, really. And the critics are brutal.\n\n(Attempts a slow-motion, exaggerated mime routine of stopping a robbery, looking increasingly frustrated.)\n\nAnd then there’s Lex. Everyone thinks Kryptonite is a weakness. No. It’s Lex Luthor’s passive-aggressive texts. “Just checking in to see if you’ve considered a more nuanced approach to global security. Let me know your thoughts.” He doesn’t want to *kill* me, he wants to *fix* me. “You’re just not living up to your potential, Superman! You need to be more decisive! More… *accountable!*” Honestly, it’s like dating my mother. \n\n(Beat)\n\nHonestly, I’m starting to think I need a restraining order. And a therapist. A *really* good therapist.\n\n(Paces slightly)\n\nAnd the succession planning? Don’t even get me started. I asked for a sabbatical. A *week* off. They started a global search for my replacement. Like I’m easily replaceable! As the analysts pointed out, **“Superman is functionally immortal (solar energy, etc.). What happens when he *eventually* decides to retire (or just needs a vacation)?”** The Academy was a disaster. They wanted someone ‘with vision.’ One applicant’s vision was exclusively focused on building a giant robot dinosaur. Another kept trying to fly through walls. It was… a learning experience. \n\n(Shakes head)\n\nThe interview questions are insane. ‘On a scale of one to ten, how comfortable are you with public scrutiny?’ ‘I’m a superhero. It comes with the territory.’ ‘Excellent. Now, describe your feelings about capes.’ I just walked out.\n\n(Looks directly at the audience, a weary expression on his face)\n\nYou know what I really want? To be a traffic controller. Just… lights. Simple, direct control. No existential crises, no codependent villains, just… red, yellow, and green. And maybe a really comfortable chair.\n\n\n\n",
        "score": {
            "brevity": 7,
            "coherence": 9,
            "originality": 8,
            "punchline": 8,
            "appeal": 7,
            "explanation": "This is a very strong bit! The premise – Superman dealing with mundane, relatable frustrations like micromanagement – is highly original and consistently funny. The coherence is excellent; the entire routine builds on this central idea. While not every line is a massive laugh, the sustained comedic voice and escalating absurdity create a consistently enjoyable experience. The punchlines are well-delivered, particularly the 'super-powered mime' line and the Lex Luthor bit. Brevity is slightly lower because it's a longer bit, and some sections could be tightened. Appeal is good, but relies on some familiarity with Superman lore; those unfamiliar might miss some nuances, but the core concept of being controlled is universal.",
            "total": 39
        }
    }
]